Revit 2024 API
DockableFrameVisibilityChangedEventArgs.PaneId Property
 The identifier for dockable pane.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public DockablePaneId PaneId { get; }
Visual Basic
Public ReadOnly Property PaneId As DockablePaneId
	Get
Visual C++
public:
property DockablePaneId^ PaneId {
	DockablePaneId^ get ();
}
See Also
DockableFrameVisibilityChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace